Autodesk.Revit.DB.ElementIntersectsElementFilter.#ctor(Autodesk.Revit.DB.Element,System.Boolean)
Constructs a filter to match elements which intersect the given element, with the
option to match all elements not intersecting the given element.
element:
The element to check for intersection.
inverted:
True if the filter should match all elements which do not intersect the given
element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category of the element is not supported for element intersection filters.
-or-
The element is not supported for element intersection filters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ElementIntersectsElementFilter.#ctor(Autodesk.Revit.DB.Element)
Constructs a filter to match elements which intersect the given element.
element:
The element to check for intersection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category of the element is not supported for element intersection filters.
-or-
The element is not supported for element intersection filters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012